// Вивести result в консоль. Перевірити тип змінної result= 5+5+’5’.
const result = 5 + 5 + "5";
console.log(typeof result);
// Створіть змінну email з вашою електронною адресою. Напишіть скрипт, який перевіряє чи містить змінна email символ @ і рахує загальну кількість символів. Результат виведіть в консоль.
const email = "schvezdania@gmail.com";
console.log(email.includes("@"));
console.log(email.length);
// Записати в окремих змінних кожне слово: My, name, is. Поєднати всі слова в змінну fullName. До змінної fullName додати ‘Viktor’. fullName вивести в консоль.
const word1 = "My";
const word2 = "name";
const word3 = "is";
// const fullName = word1 + " " + word2 + " " + word3 + " "+ "Viktor"; // це є спосіб конкатенізації
const fullName = `${word1} ${word2} ${word3} Viktor `; // це є спосіб інтерполяції
console.log(fullName);
// Створіть змінну userName з ім’ям користувача і змінну payment з сумою до оплати. За допомогою шаблонного рядка виведіть на екран через alert повідомлення на прикладі цього: «Дякуємо, Олександро! До сплати 300 гривень»
const userName = "Валеріє";
const paymeny = 560;
alert(`Дякуємо, ${userName}! До сплати ${paymeny} гривень`);

// 1)
// Створіть змінну age та присвойте їй своє поточне значення віку.
// Створіть змінну message і використайте інтерполяцію рядків, щоб присвоїти їй рядок "Мені [ваш вік] років".
// Виведіть message в консоль.
const age = 17;
const message = `Мені ${age} років`;
console.log(message);

// 2
// Створіть змінну name та присвойте їй своє ім'я.
// Створіть змінну age та присвойте їй свій вік.
// Створіть змінну city та присвойте їй назву міста, в якому ви живете.
// За допомогою інтерполяції рядків, створіть змінну bio, яка буде містити рядок у форматі: "Привіт, мене звати [ім'я], мені [вік] років, і я живу в місті [місто]".
// Виведіть bio в консоль.

const name = "Daniil";
const age1 = 17;
const city = "Кам'янське";
const bio = `Привіт, мене звати ${name}, мені ${age1} років, і я живу в місті ${city}`;
console.log(bio);
// 3)
// Створіть змінні num1 та num2 і присвойте їм будь-які числові значення.
// За допомогою інтерполяції рядків, створіть змінну result, яка буде містити рядок у форматі: "Сума чисел [num1] і [num2] дорівнює [сума]", де сума - результат додавання num1 і num2.
// Виведіть result в консоль.
const num1 = 79;
const num2 = 45;
const resultt = `Сума чисел ${num1} і ${num2} дорівнює ${num1 + num2}`;
console.log(resultt);
// 4)
// Створіть змінну text та присвойте їй будь-який рядок.
// Використовуючи метод indexOf(), знайдіть індекс першого входження слова "JavaScript" у рядку text і виведіть результат у консоль.
// Якщо слово "JavaScript" присутнє в рядку text, замініть його на "JS" за допомогою методу replace() і виведіть новий рядок у консоль.

// 5)
// Створіть змінну text та присвойте їй будь-який рядок.
// Використовуючи відповідні методи рядків, виконайте наступні операції:
// Виведіть в консоль довжину рядка.
// Виведіть в консоль перші 3 символи з рядка.
// Виведіть в консоль останні 3 символи з рядка.
// Виведіть в консоль рядок в верхньому регістрі.
// Виведіть в консоль рядок в нижньому регістрі.
const text = "Lorem ipsum dolor, sit amet consectetur adipisicing elit. ";
console.log(text.length);
console.log(text.toUpperCase());
console.log(text.toLowerCase());


// 6)
// Створіть змінні radius та pi і присвойте їм значення радіуса кола та числа π.
// За допомогою інтерполяції рядків, створіть змінну circleInfo, яка буде містити рядок у форматі: "Коло з радіусом [radius] має площу [площа], де площа - результат обчислення площі кола за формулою pi * radius^2.
// Виведіть circleInfo в консоль.
const radius = 6;
const pi = 3.14;
const circleInfo = `Коло з радіусом ${radius} має площу ${pi * Math.pow(radius, 2)}`;
console.log(circleInfo);
// Додаткові завдання дороблю