// Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
const celsius = 35;
const fahrenheit = (celsius * 9) / 5 + 32;
console.log(`${celsius}°C = ${fahrenheit}°F`);

// Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
const days = 30;
const oneHour = days * 24;
const hourMinutes = days * 24 * 60;
// console.log(oneHour);
// console.log(hourMinutes);
console.log(`У ${days} днів ${oneHour} годин та ${hourMinutes} хвилин`);

// Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
const health = 100;
const energy = 100;
console.log(health - 72);
console.log(energy - 32);

// Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.
const price = 500;
const discount = (price * 90) / 100;
console.log(`знижка на 10% становить ${discount} гривень`);
// або
// тоді в цьому випадку ми можему НЕ записувати змінну discount, а прсото обчислити коли виводимо.
console.log((price * 90) / 100);

// Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
const numbers = -1.3;
console.log(Math.floor(numbers)); //-2

const numbersTwo = 3.8;
console.log(Math.floor(numbersTwo)); // 3

// Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.
const decimalNumber = "9.8pxdscvsdv1";
console.log(Number.parseFloat(decimalNumber));

// Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
const decimalNumberTwo = "6hgfghfhs";
console.log(Number.parseInt(decimalNumberTwo));
// примітка: знаю ,що так не добре називати змінні, але у мене вже фантазія закінчилася.

// Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
const squareNumber = 5;
console.log(Math.sqrt(squareNumber));
// тепер спробуємо добути корень із числа та округлити до цілого
const sevenNumbers = 31;
const sevenNumbersSq = Math.sqrt(sevenNumbers);
console.log(Math.round(sevenNumbersSq));
// метод Math.round округлює до цілого числа

let oneNumber = prompt("Введіть будь яке довільне число");
oneNumber = Math.sqrt(oneNumber);
oneNumber = Math.round(oneNumber);
alert(
  "Ось ваше число, за яким ви отримуєте дозвіл до використання нашого функціоналу:" +
    oneNumber
);
// в принципі, як ще варіант, можна записати через розгалуження

// Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.
