// Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
const celsius = 35;
const fahrenheit = (celsius * 9) / 5 + 32;
console.log(`${celsius}°C = ${fahrenheit}°F`);

// Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
const days = 30;
const oneHour = days * 24;
const hourMinutes = days * 24 * 60;
// console.log(oneHour);
// console.log(hourMinutes);
console.log(`У ${days} днів ${oneHour} годин та ${hourMinutes} хвилин`);

// Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
const health = 100;
const energy = 100;
console.log(health - 72);
console.log(energy - 32);
